Конфигурация/InformationRegisters/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НазначениеИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеИнвестиционнойДекларации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитнаяВедомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаконодательныеОграничения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НазначениеИнвестиционнойДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НазначениеИнвестиционнойДекларации</Name>
			<BasedOn>
				<xr:Item>Catalog.ИнвестиционныеДекларации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИнвестиционныеДекларации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенийИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнвестиционныеДекларации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ИнвестиционныеДекларации/Ext/ManagerModule.bsl
// Функция - Получить текст запроса для получения актуальных инвестиционных деклараций
//
// Возвращаемое значение:
//  Строка - Текст запроса для создания виртуальной таблицы _АктуальныеИнвестиционныеДекларации, содержащей колонки "Дата, СчетДоверительногоУправления, ИнвестиционнаяДекларация"
//	В таблицу попадают инвестиционные декларации по счетам ДУ на указанные даты. Для договоров ИИС возвращаются ИД, назначенные для счета ДУ.
//	Если для счета ДУ ИИС не назначена инвестиционная декларация - возвращается инвестиционная декларация, заданная для стратегии.
//	Если ИД не задана и для стратегии - возвращается Неопределено.
//  Для корректной работы запроса ранее по тексту должна быть определена временная таблица _ТаблицаСчетов, содержащая колонки Дата и СчетДоверительногоУправления
//
Функция ПолучитьТекстЗапросаДляПолученияАктуальныхИнвестиционныхДеклараций() Экспорт

	// Законодательные ограничения назначаются на юр.физ. лицо и вид договора
	// Лимитные ведомости назначаются на юр.физ. лицо и вид договора. Внутри ИД указывается перечень счетов ДУ, к которым относится конкретная декларация
	// Инвестиционные декларации назначаются для конкретного счета ДУ или стратегии
	//
	// Параметр ДоступныеОрганизации содержит либо одну организацию, либо массив из РЭМа и Траста
	// Описание виртуальных таблиц:
	// _ТаблицаСчеов - Содержит список счетов ДУ и дат, на которые необходимо выполнить контроль
	// _ВсеКлиенты - Получаем полный список клиентов по ВСЕМ действующим счетам ДУ на каждую дату из _ТаблицаСчетов
	// _КлиентыПоОтбору - Оставляем только клиентов и виды договоров ДУ по счетам ДУ из _ТаблицаСчетов. 
	//		Для Традиции ПР также добавляется вторая организация (РЭМ/Траст)
	//		по счетам ДУ второй организации будем контролировать только законодательные ограничения
	// _СчетаДУПоОтбору - добавляем счета ДУ к таблице _КлиентыПоОтбору по соответствующим видам договоров. Добавляем для Традиции ПР ОПИФ Атлант
	// _СчетаДоверительногоУправления - конечный список счетов ДУ с клиентами и видами договоров и стратегиями, для которых будем получать состав ИД
	// _ПериодыИнвестиционныхДеклараций - даты последних назначений ИД для получения самих ИД
	// _ЛимитныеВедомостиВсе - получаем все ЛВ. В эту выборку попадут все ЛВ, независимо от того, назначены ли они счетам из _ТаблицаСчетов
	// _СовокупныеКонтроли - получаем все Законодательные ограничения, дополняем лимитками по счетам из _ТаблицаСчетов
	// _ИнвестиционныеДекларации - Получаем Инвестиционные декларации. При этом должно быть выполнено условие:
	//		Для каждого счета ДУ должна быть назначена минимум одна декларация любого вида 
	// _СоставСовокупнойИД - Полный состав ИД для контроля
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ВсеКлиенты
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ТаблицаСчетов.Дата КАК Дата,
		|		КлиентыДоверительногоУправления.Организация КАК Организация,
		|		КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК ПериодКлиента
		|	ИЗ
		|		_ТаблицаСчетов КАК _ТаблицаСчетов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|			ПО _ТаблицаСчетов.Дата >= КлиентыДоверительногоУправления.Период
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ПО (СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправления.СчетДоверительногоУправления)
		|				И (СчетаДоверительногоУправления.Организация В (&ДоступныеОрганизации))
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= _ТаблицаСчетов.Дата)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ТаблицаСчетов.Дата,
		|		КлиентыДоверительногоУправления.Организация,
		|		КлиентыДоверительногоУправления.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ПО ВложенныйЗапрос.ПериодКлиента = КлиентыДоверительногоУправления.Период
		|			И ВложенныйЗапрос.Организация = КлиентыДоверительногоУправления.Организация
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (СчетаДоверительногоУправления.Ссылка = КлиентыДоверительногоУправления.СчетДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТаблицаСчетов.Дата КАК Дата,
		|	Организации.Ссылка КАК Организация,
		|	_ТаблицаСчетов.Организация КАК Организация2,
		|	_ВсеКлиенты.Клиент КАК Клиент,
		|	_ВсеКлиенты.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ТаблицаСчетов.Организация <> Организации.Ссылка КАК ТолькоЗаконодательныеОграничения
		|ПОМЕСТИТЬ _КлиентыПоОтбору
		|ИЗ
		|	_ТаблицаСчетов КАК _ТаблицаСчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВсеКлиенты КАК _ВсеКлиенты
		|		ПО _ТаблицаСчетов.Организация = _ВсеКлиенты.Организация
		|			И _ТаблицаСчетов.СчетДоверительногоУправления = _ВсеКлиенты.СчетДоверительногоУправления
		|			И _ТаблицаСчетов.Дата = _ВсеКлиенты.Дата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (_ВсеКлиенты.Клиент = &КлиентТрадиция
		|					И _ВсеКлиенты.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|					И Организации.Ссылка В (&ДоступныеОрганизации)
		|				ИЛИ Организации.Ссылка = _ТаблицаСчетов.Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыПоОтбору.Дата КАК Дата,
		|	_КлиентыПоОтбору.Организация КАК Организация,
		|	_КлиентыПоОтбору.Клиент КАК Клиент,
		|	_КлиентыПоОтбору.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_ВсеКлиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КлиентыПоОтбору.ТолькоЗаконодательныеОграничения КАК ТолькоЗаконодательныеОграничения
		|ПОМЕСТИТЬ _СчетаДУПоОтбору
		|ИЗ
		|	_КлиентыПоОтбору КАК _КлиентыПоОтбору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВсеКлиенты КАК _ВсеКлиенты
		|		ПО _КлиентыПоОтбору.Дата = _ВсеКлиенты.Дата
		|			И _КлиентыПоОтбору.Организация = _ВсеКлиенты.Организация
		|			И _КлиентыПоОтбору.ВидДоговораДоверительногоУправления = _ВсеКлиенты.ВидДоговораДоверительногоУправления
		|			И _КлиентыПоОтбору.Клиент = _ВсеКлиенты.Клиент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КлиентыПоОтбору.Дата,
		|	СчетаДоверительногоУправления.Организация,
		|	_КлиентыПоОтбору.Клиент,
		|	_КлиентыПоОтбору.ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.Ссылка,
		|	ИСТИНА
		|ИЗ
		|	_КлиентыПоОтбору КАК _КлиентыПоОтбору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (_КлиентыПоОтбору.Клиент = &КлиентТрадиция)
		|			И _КлиентыПоОтбору.Организация = СчетаДоверительногоУправления.Организация
		|			И (_КлиентыПоОтбору.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами))
		|			И (СчетаДоверительногоУправления.Ссылка = &СчетДУАтлант)
		|			И (_КлиентыПоОтбору.Дата < ДАТАВРЕМЯ(2024, 4, 19))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУПоОтбору.Дата КАК Дата,
		|	_СчетаДУПоОтбору.Организация КАК Организация,
		|	_СчетаДУПоОтбору.Клиент КАК Клиент,
		|	_СчетаДУПоОтбору.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДУПоОтбору.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДУПоОтбору.ТолькоЗаконодательныеОграничения КАК ТолькоЗаконодательныеОграничения,
		|	ЕСТЬNULL(СтратегииИндивидуальногоИнвестирования.Стратегия, НЕОПРЕДЕЛЕНО) КАК Стратегия
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	_СчетаДУПоОтбору КАК _СчетаДУПоОтбору
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СчетаДУПоОтбору.Дата КАК Дата,
		|			_СчетаДУПоОтбору.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МАКСИМУМ(СтратегииИндивидуальногоИнвестирования.Период) КАК ПериодСтратегии
		|		ИЗ
		|			_СчетаДУПоОтбору КАК _СчетаДУПоОтбору
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|				ПО _СчетаДУПоОтбору.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления
		|					И _СчетаДУПоОтбору.Дата >= СтратегииИндивидуальногоИнвестирования.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СчетаДУПоОтбору.Дата,
		|			_СчетаДУПоОтбору.СчетДоверительногоУправления) КАК ВложенныйЗапрос
		|		ПО _СчетаДУПоОтбору.Дата = ВложенныйЗапрос.Дата
		|			И _СчетаДУПоОтбору.СчетДоверительногоУправления = ВложенныйЗапрос.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК СтратегииИндивидуальногоИнвестирования
		|		ПО (ВложенныйЗапрос.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестирования.СчетДоверительногоУправления)
		|			И (ВложенныйЗапрос.ПериодСтратегии = СтратегииИндивидуальногоИнвестирования.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Дата КАК Дата,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ТолькоЗаконодательныеОграничения КАК ТолькоЗаконодательныеОграничения,
		|	МАКСИМУМ(ИнвестиционныеДекларации.Период) КАК ПериодИД,
		|	ИнвестиционныеДекларации.Организация КАК ОрганизацияИД,
		|	ИнвестиционныеДекларации.Субъект КАК СубъектИД,
		|	ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправленияИД,
		|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации
		|ПОМЕСТИТЬ _ПериодыИнвестиционныхДеклараций
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|		ПО _СчетаДоверительногоУправления.Дата >= ИнвестиционныеДекларации.Период
		|			И (ИнвестиционныеДекларации.Организация = &Организация)
		|			И (НЕ _СчетаДоверительногоУправления.ТолькоЗаконодательныеОграничения
		|				ИЛИ ИнвестиционныеДекларации.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ЗаконодательныеОграничения))
		|			И (_СчетаДоверительногоУправления.СчетДоверительногоУправления = ИнвестиционныеДекларации.Субъект
		|				ИЛИ _СчетаДоверительногоУправления.Стратегия = ИнвестиционныеДекларации.Субъект
		|				ИЛИ _СчетаДоверительногоУправления.Клиент = ИнвестиционныеДекларации.Субъект
		|					И _СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СчетаДоверительногоУправления.Дата,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления.ТолькоЗаконодательныеОграничения,
		|	ИнвестиционныеДекларации.Организация,
		|	ИнвестиционныеДекларации.Субъект,
		|	ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления,
		|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Дата КАК Дата,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|	НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|	ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации КАК Назначение
		|ПОМЕСТИТЬ _ЛимитныеВедомостиВсе
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыИнвестиционныхДеклараций КАК _ПериодыИнвестиционныхДеклараций
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|			ПО _ПериодыИнвестиционныхДеклараций.ПериодИД = ИнвестиционныеДекларации.Период
		|				И (ИнвестиционныеДекларации.Субъект = _ПериодыИнвестиционныхДеклараций.СубъектИД)
		|				И (ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления = _ПериодыИнвестиционныхДеклараций.ВидДоговораДоверительногоУправленияИД)
		|				И (ИнвестиционныеДекларации.Организация = _ПериодыИнвестиционныхДеклараций.ОрганизацияИД)
		|				И (ИнвестиционныеДекларации.ТипИнвестиционнойДекларации = _ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации)
		|				И (ИнвестиционныеДекларации.Действует)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
		|			ПО (ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка)
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.СчетаДоверительногоУправления КАК ИнвестиционныеДекларацииСчетаДоверительногоУправления
		|			ПО (НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация = ИнвестиционныеДекларацииСчетаДоверительногоУправления.Ссылка)
		|				И _ПериодыИнвестиционныхДеклараций.СчетДоверительногоУправления = ИнвестиционныеДекларацииСчетаДоверительногоУправления.СчетДоверительногоУправления
		|		ПО (_ПериодыИнвестиционныхДеклараций.Дата = _СчетаДоверительногоУправления.Дата)
		|			И (_ПериодыИнвестиционныхДеклараций.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления)
		|			И (_ПериодыИнвестиционныхДеклараций.ТолькоЗаконодательныеОграничения = _СчетаДоверительногоУправления.ТолькоЗаконодательныеОграничения)
		|			И (_ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Дата КАК Дата,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|	НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|	ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации КАК Назначение
		|ПОМЕСТИТЬ _СовокупныеКонтроли
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодыИнвестиционныхДеклараций КАК _ПериодыИнвестиционныхДеклараций
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|			ПО _ПериодыИнвестиционныхДеклараций.ПериодИД = ИнвестиционныеДекларации.Период
		|				И (ИнвестиционныеДекларации.Субъект = _ПериодыИнвестиционныхДеклараций.СубъектИД)
		|				И (ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления = _ПериодыИнвестиционныхДеклараций.ВидДоговораДоверительногоУправленияИД)
		|				И (ИнвестиционныеДекларации.Организация = _ПериодыИнвестиционныхДеклараций.ОрганизацияИД)
		|				И (ИнвестиционныеДекларации.ТипИнвестиционнойДекларации = _ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации)
		|				И (ИнвестиционныеДекларации.Действует)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
		|			ПО (ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка)
		|		ПО (_ПериодыИнвестиционныхДеклараций.Дата = _СчетаДоверительногоУправления.Дата)
		|			И (_ПериодыИнвестиционныхДеклараций.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления)
		|			И (_ПериодыИнвестиционныхДеклараций.ТолькоЗаконодательныеОграничения = _СчетаДоверительногоУправления.ТолькоЗаконодательныеОграничения)
		|			И (_ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ЗаконодательныеОграничения))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ЛимитныеВедомостиВсе.Дата,
		|	_ЛимитныеВедомостиВсе.Организация,
		|	_ЛимитныеВедомостиВсе.Клиент,
		|	_ЛимитныеВедомостиВсе.ВидДоговораДоверительногоУправления,
		|	_ЛимитныеВедомостиВсе.СчетДоверительногоУправления,
		|	_ЛимитныеВедомостиВсе.ТипИнвестиционнойДекларации,
		|	_ЛимитныеВедомостиВсе.ИнвестиционнаяДекларация,
		|	_ЛимитныеВедомостиВсе.Назначение
		|ИЗ
		|	_ЛимитныеВедомостиВсе КАК _ЛимитныеВедомостиВсе
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_ЛимитныеВедомостиВсе.Назначение КАК Назначение
		|		ИЗ
		|			_ЛимитныеВедомостиВсе КАК _ЛимитныеВедомостиВсе
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаСчетов КАК _ТаблицаСчетов
		|				ПО _ЛимитныеВедомостиВсе.Дата = _ТаблицаСчетов.Дата
		|					И _ЛимитныеВедомостиВсе.СчетДоверительногоУправления = _ТаблицаСчетов.СчетДоверительногоУправления) КАК Назначения
		|		ПО _ЛимитныеВедомостиВсе.Назначение = Назначения.Назначение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления.Дата КАК Дата,
		|	_СчетаДоверительногоУправления.Организация КАК Организация,
		|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
		|	_СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация) КАК ТипИнвестиционнойДекларации,
		|	НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|	ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации КАК Назначение
		|ПОМЕСТИТЬ _ИнвестиционныеДекларации
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_СчетаДоверительногоУправления.Дата КАК Дата,
		|		_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		ИСТИНА КАК ТребуетсяИД
		|	ИЗ
		|		_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаСчетов КАК _ТаблицаСчетов
		|			ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = _ТаблицаСчетов.СчетДоверительногоУправления
		|				И _СчетаДоверительногоУправления.Дата = _ТаблицаСчетов.Дата
		|			ЛЕВОЕ СОЕДИНЕНИЕ _СовокупныеКонтроли КАК _СовокупныеКонтроли
		|			ПО _СчетаДоверительногоУправления.СчетДоверительногоУправления = _СовокупныеКонтроли.СчетДоверительногоУправления
		|				И _СчетаДоверительногоУправления.Дата = _СовокупныеКонтроли.Дата
		|	ГДЕ
		|		_СовокупныеКонтроли.Дата ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_СовокупныеКонтроли.Дата,
		|		_СовокупныеКонтроли.СчетДоверительногоУправления,
		|		ЛОЖЬ
		|	ИЗ
		|		_СовокупныеКонтроли КАК _СовокупныеКонтроли) КАК СчетаДляИндивидуальныхИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО СчетаДляИндивидуальныхИД.Дата = _СчетаДоверительногоУправления.Дата
		|			И СчетаДляИндивидуальныхИД.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПериодыИнвестиционныхДеклараций КАК _ПериодыИнвестиционныхДеклараций
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|			ПО _ПериодыИнвестиционныхДеклараций.ПериодИД = ИнвестиционныеДекларации.Период
		|				И (ИнвестиционныеДекларации.Субъект = _ПериодыИнвестиционныхДеклараций.СубъектИД)
		|				И (ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления = _ПериодыИнвестиционныхДеклараций.ВидДоговораДоверительногоУправленияИД)
		|				И (ИнвестиционныеДекларации.Организация = _ПериодыИнвестиционныхДеклараций.ОрганизацияИД)
		|				И (ИнвестиционныеДекларации.ТипИнвестиционнойДекларации = _ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации)
		|				И (ИнвестиционныеДекларации.Действует)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
		|			ПО (ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка)
		|		ПО (_ПериодыИнвестиционныхДеклараций.Дата = _СчетаДоверительногоУправления.Дата)
		|			И (_ПериодыИнвестиционныхДеклараций.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления)
		|			И (_ПериодыИнвестиционныхДеклараций.ТолькоЗаконодательныеОграничения = _СчетаДоверительногоУправления.ТолькоЗаконодательныеОграничения)
		|			И (_ПериодыИнвестиционныхДеклараций.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация))
		|ГДЕ
		|	(НЕ НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация ЕСТЬ NULL
		|			ИЛИ СчетаДляИндивидуальныхИД.ТребуетсяИД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Объединение.Дата КАК Дата,
		|	_Объединение.Организация КАК Организация,
		|	_Объединение.Клиент КАК Клиент,
		|	_Объединение.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_Объединение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _Объединение.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ЗаконодательныеОграничения)
		|			ТОГДА 1
		|		КОГДА _Объединение.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость)
		|			ТОГДА 2
		|		КОГДА _Объединение.ТипИнвестиционнойДекларации = ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация)
		|			ТОГДА 3
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПорядокКонтроля,
		|	_Объединение.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|	ЕСТЬNULL(_Объединение.ИнвестиционнаяДекларация, ЗНАЧЕНИЕ(Справочник.ИнвестиционныеДекларации.ПустаяСсылка)) КАК ИнвестиционнаяДекларация,
		|	ЕСТЬNULL(_Объединение.ИнвестиционнаяДекларация.СовокупныйКонтроль, ЛОЖЬ) КАК СовокупныйКонтроль,
		|	ЕСТЬNULL(_Объединение.Назначение, ЗНАЧЕНИЕ(Документ.НазначениеИнвестиционнойДекларации.ПустаяСсылка)) КАК Назначение
		|ПОМЕСТИТЬ _СоставСовокупнойИД
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СовокупныеКонтроли.Дата КАК Дата,
		|		_СовокупныеКонтроли.Организация КАК Организация,
		|		_СовокупныеКонтроли.Клиент КАК Клиент,
		|		_СовокупныеКонтроли.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|		_СовокупныеКонтроли.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_СовокупныеКонтроли.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|		_СовокупныеКонтроли.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|		_СовокупныеКонтроли.Назначение КАК Назначение
		|	ИЗ
		|		_СовокупныеКонтроли КАК _СовокупныеКонтроли
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_ИнвестиционныеДекларации.Дата,
		|		_ИнвестиционныеДекларации.Организация,
		|		_ИнвестиционныеДекларации.Клиент,
		|		_ИнвестиционныеДекларации.ВидДоговораДоверительногоУправления,
		|		_ИнвестиционныеДекларации.СчетДоверительногоУправления,
		|		_ИнвестиционныеДекларации.ТипИнвестиционнойДекларации,
		|		_ИнвестиционныеДекларации.ИнвестиционнаяДекларация,
		|		_ИнвестиционныеДекларации.Назначение
		|	ИЗ
		|		_ИнвестиционныеДекларации КАК _ИнвестиционныеДекларации) КАК _Объединение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ВсеКлиенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КлиентыПоОтбору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СчетаДУПоОтбору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СчетаДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ПериодыИнвестиционныхДеклараций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ЛимитныеВедомостиВсе
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СовокупныеКонтроли
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИнвестиционныеДекларации";
	
	Возврат ТекстЗапроса;

КонецФункции
